In [2]:
import numpy as np
import pandas as pd

In [7]:
df = pd.read_csv("example.csv")
df

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [8]:
from numpy.random import randn
np.random.seed(101)

In [9]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [10]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
df['new']=df['W']+df['Y']

In [13]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [15]:
df.drop('A',axis=0)

          W         X         Y         Z       new
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [16]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [20]:
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.614819
Name: A, dtype: float64

In [21]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [22]:
df>0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [23]:
df[df>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [24]:
df[df['W']>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [25]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [26]:
df[(df['W']>0)&(df['Y']>1)]

          W         X         Y         Z       new
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [27]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [37]:
data={'Company':['Google','Google','Facebook','MSFT','Nike'],'Person':['Yash','Rohan','Pats','Pratik','Kshitij'],'Sales':[200,175,120,150,300]}

In [38]:
df=pd.DataFrame(data)

In [39]:
df

    Company   Person  Sales
0    Google     Yash    200
1    Google    Rohan    175
2  Facebook     Pats    120
3      MSFT   Pratik    150
4      Nike  Kshitij    300

In [40]:
df.groupby('Company')

In [43]:
by_comp=df.groupby("Company")
by_comp

In [44]:
by_comp.mean()

          Sales
Company
Facebook  120.0
Google    187.5
MSFT      150.0
Nike      300.0

In [45]:
by_comp.max()

           Person  Sales
Company
Facebook     Pats    120
Google       Yash    200
MSFT       Pratik    150
Nike      Kshitij    300

In [46]:
by_comp.min()

           Person  Sales
Company
Facebook     Pats    120
Google      Rohan    175
MSFT       Pratik    150
Nike      Kshitij    300

In [47]:
by_comp.count()

          Person  Sales
Company
Facebook       1      1
Google         2      2
MSFT           1      1
Nike           1      1

In [48]:
by_comp.describe()

         Sales
         count   mean       std    min     25%    50%     75%    max
Company
Facebook   1.0  120.0       NaN  120.0  120.00  120.0  120.00  120.0
Google     2.0  187.5  17.67767  175.0  181.25  187.5  193.75  200.0
MSFT       1.0  150.0       NaN  150.0  150.00  150.0  150.00  150.0
Nike       1.0  300.0       NaN  300.0  300.00  300.0  300.00  300.0

## Merging and Joining

In [50]:
pd.merge(left,right,on='key')

NameError: name 'left' is not defined